high-level-tests/load-testing/scenarios/signup-and-campaign-participation.yaml
config:
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load

  variables:
    campaignCode: "SIMPLIFIE"

scenarios:
  - name: 'Inscription, participation à une campagne et partage des résultats'
    flow:
      - function: "setupSignupFormData"

      ### ---------------------- ###
      ### From page /inscription ###
      ### ---------------------- ###

      # Submit user form
      - post:
          url: "/api/users"
          json:
            data:
              attributes:
                cgu: true
                email: "{{ email }}"
                first-name: "{{ firstName }}"
                last-name: "{{ lastName }}"
                password: "{{ password }}"

      # Authenticate user
      - post:
          url: "/api/token"
          headers:
            content-type: "application/x-www-form-urlencoded"
          body: "grant_type=password&scope=mon-pix&username={{ email }}&password={{ password }}"
          capture:
            - json: "$.access_token"
              as: "accessToken"
            - json: "$.user_id"
              as: "userId"

      # Get user profile
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Fetch campaign participations
      - get:
          url: "/api/users/{{ userId }}/campaign-participations"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      ### ----------------- ###
      ### From page /compte ###
      ### ----------------- ###

      # Get campaign target
      - get:
          url: "/api/campaigns?filter[code]={{ campaignCode }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          capture:
            json: "$.data.id"
            as: "campaignId"

      # Create campaign-participation
      - post:
          url: "/api/campaign-participations"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            data:
              type: "campaign-participations"
              attributes:
                participant-external-id: null
              relationships:
                campaign:
                  data:
                    id: "{{ campaignId }}"
                    type: "campaigns"
          capture:
            json: "$.data.id"
            as: "campaignParticipationId"

      # Get campaign assessment filtered
      - get:
          url: "/api/assessments?filter[type]=CAMPAIGN&filter[codeCampaign]={{ campaignCode }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          capture:
            json: "$.data[0].id"
            as: "assessmentId"

      # Fetch assessment
      - get:
          url: "/api/assessments/{{ assessmentId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Fetch assessment next challenge
      - get:
          url: "/api/assessments/{{ assessmentId }}/next"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          capture:
            json: "$.data.id"
            as: "challengeId"

      - loop:
          # Fetch answer (if exists)
          - get:
              url: "/api/answers?assessmentId={{ assessmentId }}&challengeId={{ challengeId }}"
              headers:
                Authorization: "Bearer {{ accessToken }}"

          ### -------------------------------------------------------------- ###
          ### From page /assessments/:assessment_id/challenges/:challenge_id ###
          ### -------------------------------------------------------------- ###

          # Submit "skip" answer
          - post:
              url: "/api/answers"
              headers:
                Authorization: "Bearer {{ accessToken }}"
              json:
                data:
                  attributes:
                    value: "#ABAND#"
                  relationships:
                    assessment:
                      data:
                        id: "{{ assessmentId }}"
                        type: "assessments"
                    challenge:
                      data:
                        id: "{{ challengeId }}"
                        type: "challenges"
                  type: "answers"

          # Fetch assessment next challenge
          - get:
              url: "/api/assessments/{{ assessmentId }}/next"
              headers:
                Authorization: "Bearer {{ accessToken }}"
              afterResponse: "handleResponseForChallengeId"

        whileTrue: "foundNextChallenge"

      # Complete assessment
      - patch:
          url: "/api/assessments/{{ assessmentId }}/complete-assessment"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Fetch assessment-result
      - get:
          url: "/api/users/{{ userId }}/campaigns/{{ campaignId }}/assessment-result"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Share campaign participation
      - patch:
          url: "/api/campaign-participations/{{ campaignParticipationId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      ### ----------------------------------------------------- ###
      ### From page /assessment-result, go back to profile page ###
      ### ----------------------------------------------------- ###

      # Get user profile
      - get:
          url: "/api/users/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      # Fetch campaign participations
      - get:
          url: "/api/users/{{ userId }}/campaign-participations"
          headers:
            Authorization: "Bearer {{ accessToken }}"